# DS-SF-36 | 04 | Databases and Scrapping | Assignment | Starter Code

## `SQLite` and Bistro

In this assignment, we will be exploring the `bistro` dataset.  The previous assignment used `pandas`.  Today, we'll answer the same questions but using `SQLite`.  In some situations, `pandas` will be a better solution.  In others, doing it using `SQL` will make more sense.  As you gain more experience, you'll know which one to use.

> ### Question 1.  Import the `sqlite3` package.

In [1]:
import os

import pandas as pd
pd.set_option('display.max_rows', 10)
pd.set_option('display.notebook_repr_html', True)
pd.set_option('display.max_columns', 10)
import sqlite3
# TODO

> ### Question 2.  Connect to the `dataset-04-bistro.db` database.  The rest of this assignment focus on the `bistro` table.

In [2]:
db = sqlite3.connect(os.path.join('..', 'datasets', 'dataset-04-bistro.db'))
bistro = pd.io.sql.read_sql(
'''
SELECT *                  ---* means everything    
    FROM bistro       --- from a table, properties is a table 
    
;
''', con = db)          # con means the connection

In [123]:
db = sqlite3.connect(os.path.join('..', 'datasets', 'dataset-04-bistro.db'))
bistro = pd.io.sql.read_sql(
'''
SELECT *                  ---* means everything    
    FROM bistro       --- from a table, properties is a table 
    
;
''', con = db)          # con means the connection

> ### Question 3.  How many samples (i.e., rows) are in this dataset?

In [88]:
pd.io.sql.read_sql(
'''
SELECT COUNT()                 ---* means everything    
    FROM bistro       --- from a table, properties is a table 
    
;
''', con = db)          # con means the connection

   COUNT()
0      244

Answer: TODO

> ### Question 4.  Print the first two rows of the table to the console.

In [90]:
pd.io.sql.read_sql(
'''
SELECT *                ---* means everything    
    FROM bistro       --- from a table, properties is a table 
    LIMIT 2
;
''', con = db)          # con means the connection

   index     day    time      name  gender  is_smoker  party  check   tip
0      0  Sunday  Dinner  Kimberly  Female          0      2  16.99  1.01
1      1  Sunday  Dinner  Nicholas    Male          0      3  10.34  1.66

> ### Question 5.  For which week days does the dataset has data for?

In [95]:
pd.io.sql.read_sql(
'''
SELECT DISTINCT day           ---* means everything    
    FROM bistro       --- from a table, properties is a table 
    
;
''', con = db)          # con means the connection

        day
0    Sunday
1  Saturday
2  Thursday
3    Friday

Answer: TODO

> ### Question 6.  How often was the bistro patronized for each week day?

In [103]:
#bistro.groupby('day').count()
pd.io.sql.read_sql(
'''
SELECT day, COUNT() as total_visits       ---* means everything    
    FROM bistro       --- from a table, properties is a table 
    GROUP BY day
    ORDER BY day
;
''', con = db)          # con means the connection

        day  total_visits
0    Friday            19
1  Saturday            87
2    Sunday            76
3  Thursday            62

Answer: TODO

> ### Question 7.  How much tip did waiters collect for each week day?

In [104]:
#bistro[['day','tip']].groupby('day').sum()
pd.io.sql.read_sql(
'''
SELECT  day, SUM(tip) as total_tips        ---* means everything    
    FROM bistro       --- from a table, properties is a table 
    GROUP BY day
;
''', con = db)          # con means the connection

        day  total_tips
0    Friday       51.96
1  Saturday      260.40
2    Sunday      247.39
3  Thursday      171.83

Answer: TODO

> ### Question 8.  What is the average tip per check (in absolute \$) for each week day?

In [107]:
#bistro[['day','tip']].groupby('day').mean()
pd.io.sql.read_sql(
'''
SELECT day, sum(tip)/COUNT() as percentage        ---* means everything    
    FROM bistro       --- from a table, properties is a table 
    GROUP BY day
;
''', con = db)          # con means the connection

        day  percentage
0    Friday    2.734737
1  Saturday    2.993103
2    Sunday    3.255132
3  Thursday    2.771452

Answer: TODO

> ### Question 9.  What is the average tip per check (as a percentage of the check) for each week day?

(`CHECK` is a reserved keywork; use `` `check` `` (put the name between backticks) to reference the `check` column)

In [121]:

pd.io.sql.read_sql(
'''
WITH tip_percentage AS
    (SELECT day, tip/"check"as percentage       ---* means everything    
     FROM bistro)
        
SELECT day, AVG(percentage) as avg_tip
    FROM tip_percentage
    GROUP BY day
;
''', con = db)

        day   avg_tip
0    Friday  0.169913
1  Saturday  0.153152
2    Sunday  0.166897
3  Thursday  0.161276

In [124]:
bistro['percentage'] = bistro.tip / bistro.check
bistro[['day','percentage']].groupby('day').mean()

          percentage
day
Friday      0.169913
Saturday    0.153152
Sunday      0.166897
Thursday    0.161276

Answer: TODO

> ### Question 10.  Are there any name in common between male and female patrons?  (E.g., `Chris` can refer to either a man or a woman)

In [33]:
MaleNames = bistro.name[bistro.gender == 'Male']
FemaleNames = bistro.name[bistro.gender == 'Female']
set(MaleNames).intersection(FemaleNames)

{'Casey'}

In [126]:

pd.io.sql.read_sql(
'''
SELECT DISTINCT name       ---* means everything    
     FROM bistro
     WHERE gender = 'Male'
     
INTERSECT
SELECT DISTINCT name       ---* means everything    
     FROM bistro
     WHERE gender = 'Female'

;
''', con = db)

    name
0  Casey

Answer: TODO

> ### Question 11.  If no patrons share the same name, how many unique patrons are in the dataset?

In [132]:

pd.io.sql.read_sql(
'''
WITH different_name AS
    (SELECT DISTINCT name  
         FROM bistro)
         
SELECT COUNT()
    FROM different_name
;
''', con = db)

   COUNT()
0      181

Answer: TODO

> ### Question 12.  How many times did `Kevin` patronized the bistro?  How about `Alice`?

In [42]:
# TODO
bistro[bistro.name == "Kevin"].count()[1]
bistro[bistro.name == "Alice"].count()[1]

2

In [133]:

pd.io.sql.read_sql(
'''
SELECT COUNT()       ---* means everything    
     FROM bistro
     WHERE name = 'Kevin'

;
''', con = db)

   COUNT()
0        4

In [134]:

pd.io.sql.read_sql(
'''
SELECT COUNT()       ---* means everything    
     FROM bistro
     WHERE name = 'Alice'

;
''', con = db)

   COUNT()
0        2

Answer: TODO

> ### Question 13.  Who are the top 3 female and male patrons?

In [82]:
# TODO
bistro[bistro.gender == 'Male'].name.value_counts()[0:3]
bistro[bistro.gender == 'Female'].name.value_counts()[0:3]

Mary     4
Laura    3
Casey    3
Name: name, dtype: int64

In [139]:

pd.io.sql.read_sql(
'''
SELECT name, COUNT() as frequency       ---* means everything    
     FROM bistro
     WHERE gender = 'Male'
     GROUP BY name
     ORDER BY frequency DESC
     LIMIT 3
;
''', con = db)

    name  frequency
0  David          8
1  Casey          5
2  James          5

In [140]:

pd.io.sql.read_sql(
'''
SELECT name, COUNT() as frequency       ---* means everything    
     FROM bistro
     WHERE gender = 'Female'
     GROUP BY name
     ORDER BY frequency DESC
     LIMIT 3
;
''', con = db)

    name  frequency
0   Mary          4
1  Casey          3
2  Laura          3

Answer: TODO

> ### Question 14.  Who's the best tipper (as a fraction of all tips over all check totals)?  Who's the worst?  How many times did they patronize the bistro?

In [84]:
sorted_df = bistro[['name','percentage']].groupby('name').mean().sort_values('percentage')
sorted_df.percentage

name
Jeremy      0.035638
Mildred     0.056433
Destiny     0.056797
Kimberly    0.059447
Willie      0.066534
              ...
Zackary     0.266312
Dennis      0.280535
Bailey      0.325733
Maryann     0.416667
Daniel      0.430215
Name: percentage, dtype: float64

In [146]:
pd.io.sql.read_sql(
'''
SELECT name, sum(tip)/sum("check") as percentage   
     FROM bistro
     GROUP BY name
     ORDER BY percentage DESC
;
''', con = db)

         name  percentage
0     Maryann    0.416667
1      Bailey    0.325733
2      Daniel    0.313607
3      Dennis    0.280535
4     Zackary    0.266312
..        ...         ...
176    Willie    0.066534
177  Kimberly    0.059447
178   Destiny    0.056797
179   Mildred    0.056433
180    Jeremy    0.035638

[181 rows x 2 columns]

Answer: TODO